uploads/xml/Travelport-Request-651b04b2984f8-6106.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="8b87b07305e31029b3e6adc1122260be">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="ORN"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="SOF"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2023-10-20"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Business"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
        <air:FlightType NonStopDirects="true"/>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
